/*დავალებაში სადაც წერია რომ ფუნქციამ უნდა დააბრუნოს მნიშვნელობა - ფუნქციის მიერ დაბრუნებული მნიშვნელობა/შედეგი/result 
უნდა დაიბეჭდოს ფუნქციის გარეთ 
დავალებაში რომელშიც წერია რომ ფუნქციამ უნდა
დაბეჭდოს result ნიშნავს რომ ფუნქციას არ აქვს return და ფუნქციაშივე უნდა დაიბეჭდოს შედეგი.*/


// 1. დაწერეთ ფუნქცია რომელსაც გადასცემ ორ რიცხვს (m,n) და დააბრუნებს რომელიც მეტია იმ რიცხვს ,
//  თუ რიცხვები ტოლია დააბრუნებს 0 -ს

function t (m,n) {
   if (m>n) return m;
   if (m<n) return n;
   return 0
};
console.log(t(10,25));
  console.log(t(228,25));
   console.log(t(10,10));

// 2. დაწერეთ ფუნქცია რომელსაც გადასცემთ ორ ცვლადს(რიცხვს), დააბრუნეთ რიცხვების ჯამი

function i (m,n){return m+n};
console.log(i(20,5));



// 3. დაწერეთ ფუნქცია რომელიც დააბეჭდავს თქვენ სახელს და გვარს ( ფუნქციას არ აქვს პარამეტრი)

function g (){
    console.log("Giorgi","Todua");
}

g();

// 4. დაწერეთ ფუნქცია ორი პარამეტრით : firstname და lastname დააბრუნეთ სრული სახელი და 
// დაბეჭდეთ ( ფუნქცია აბრუნებს სრულ სახელს და ფუნქციის გარეთ ბეჭდავთ)   ?????

function t (firstname,lastname){
    return firstname +" "+ lastname
}

console.log("ფუნქცია აბრუნებს სრულ სახელს",t("Gio","Todua"));

// 5. Დაწერეთ ფუნქცია რომელსაც გადასცემთ ერთ რიცხვს (n) და ფუნქციამ უნდა დააბრუნოს 1 დან
//  ამ რიცხვამდე  (n-მდე) რიცხვების ნამრავლი ( ანუ თუ რიცხვი არის 3 ფუნქციამ უნდა დააბრუნოს 1*2*3 -ის მნიშვნელობა, 
//     დაგჭირდებათ ახალი ცვლადის გამოცხადება ფუნქციის შიგნით რომელსაც მიანიჭებთ ნამრავლის მნიშვნელობას. Პ.ს. გამოიყენეთ
//      თქვენთვის სასურველი ციკლი)


function gt (n){ let multyply=1;
for(let i=1;i<=n; i++){
    multyply*=i
} return multyply;
};

console.log(gt(5));


// Შემდეგი დავალებებისთვის გამოიყენეთ :ობიექტი student -
//  რომელსაც აქვს შემდეგი properties: firstName, lastName, age, scores (scores არის შემდეგი რიცხვების მასივი: 4,7,5,3,2) 
//  და მეთოდი fullName რომელიც აბრუნებს სტუდენტის სრულ სახელს ( ობიექტი შეიცავს მეთოდს, ცალკე ფუნქციად არ უნდა დაწეროთ ) 

let student ={
    firstName:"Gio", 
    lastName: "Todua",
    age:25,
    scores: [4,7,5,3,2],
    fullname(){ 
//       return this.firstName +" "+ this.lastName;
console.log (this.firstName+" "+this.lastName)
    }
}

// 6. დაბეჭდეთ  სტუდენტის სრული სახელი (სახელი+გვარი-  გამოიყენეთ student ობიექტის მეთოდი)
student.fullname()
//console.log(student.fullname())

// 7. Დაწერეთ ფუნქცია რომელსაც გადასცემთ სტუდენტის ქულებს ( scores) და ფუნქცია დააბრუნებს  ქულების ჯამს


function sum (scores){let sum=0;
    for (let i of scores){
        sum+=i;
    } return sum

}
console.log(sum(student.scores));

// 8. დაბეჭდეთ სტუდენტის სახელი და ასაკი

student.fullname()
console.log(student.age);
